<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Библиотеки-/-данные" data-toc-modified-id="Библиотеки-/-данные-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Библиотеки / данные</a></span></li><li><span><a href="#Мотивация" data-toc-modified-id="Мотивация-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Мотивация</a></span></li><li><span><a href="#Операции" data-toc-modified-id="Операции-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Операции</a></span><ul class="toc-item"><li><span><a href="#сброс" data-toc-modified-id="сброс-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>сброс</a></span></li><li><span><a href="#установка" data-toc-modified-id="установка-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>установка</a></span></li></ul></li><li><span><a href="#Иерархическая-индексация" data-toc-modified-id="Иерархическая-индексация-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Иерархическая индексация</a></span></li><li><span><a href="#Типы" data-toc-modified-id="Типы-5"><span class="toc-item-num">5&nbsp;&nbsp;</span><a href="http://pandas.pydata.org/pandas-docs/stable/user_guide/advanced.html#index-types" target="_blank">Типы</a></a></span><ul class="toc-item"><li><span><a href="#Основной-тип-Index" data-toc-modified-id="Основной-тип-Index-5.1"><span class="toc-item-num">5.1&nbsp;&nbsp;</span>Основной тип Index</a></span></li><li><span><a href="#Int64Index-и-RangeIndex" data-toc-modified-id="Int64Index-и-RangeIndex-5.2"><span class="toc-item-num">5.2&nbsp;&nbsp;</span>Int64Index и RangeIndex</a></span></li><li><span><a href="#Float64Index" data-toc-modified-id="Float64Index-5.3"><span class="toc-item-num">5.3&nbsp;&nbsp;</span>Float64Index</a></span></li></ul></li></ul></div>

## Библиотеки / данные

импортируем numpy и pandas

In [1]:
import numpy as np
import pandas as pd

настойки pandas

In [2]:
pd.options.display.max_rows = 10

- считываем данные
- используем столбец Symbol в качестве индекса 
- считываем только столбцы ['Symbol', 'Sector', 'Price', 'Book Value']

In [3]:
sp500 = pd.read_csv("data/sp500.csv",
                   index_col='Symbol',
                   usecols=['Symbol', 'Sector', 'Price', 'Book Value'])

## Мотивация

создаем DataFrame для примера

In [4]:
np.random.seed(123)
df = pd.DataFrame({'value': np.random.random(10000), 'key': range(100, 10100)})
df.head()

      value  key
0  0.696469  100
1  0.286139  101
2  0.226851  102
3  0.551315  103
4  0.719469  104

отбираем строку, в которой значение столбца key равно 10099

In [5]:
df[df.key==10099]

         value    key
9999  0.613297  10099

измеряем время выполнения операции отбора

In [6]:
%timeit df[df.key==10099]

440 µs ± 2.21 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

превращаем столбец key в index

In [7]:
df_with_index = df.set_index(['key'])
df_with_index.head()

        value
key
100  0.696469
101  0.286139
102  0.226851
103  0.551315
104  0.719469

теперь можно найти это значение с помощью индекса

In [8]:
df_with_index.loc[10099]

value    0.613297
Name: 10099, dtype: float64

и теперь операция выполняется на много быстрее

In [10]:
%timeit df_with_index.loc[10099]

98.2 µs ± 263 ns per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [11]:
440/98.2

4.480651731160896

<center><font color = 'green'><b>Вывод: использование индекса повышает скорость доступа к данным более чем в 4.5 раза!</b></font>

## Операции

### сброс

исследуем несколько строк DataFrame data

In [12]:
sp500.head(3)

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABT     Health Care   39.60      15.573
ABBV    Health Care   53.95       2.954

сбрасываем индекс, помещая значения индекса в столбец

In [13]:
index_moved_to_col = sp500.reset_index()
index_moved_to_col.head(5)

  Symbol                  Sector   Price  Book Value
0    MMM             Industrials  141.14      26.668
1    ABT             Health Care   39.60      15.573
2   ABBV             Health Care   53.95       2.954
3    ACN  Information Technology   79.79       8.326
4    ACE              Financials  102.91      86.897

### установка

а теперь делаем столбец Sector индексом

In [14]:
index_moved_to_col.set_index('Sector').head()

                       Symbol   Price  Book Value
Sector
Industrials               MMM  141.14      26.668
Health Care               ABT   39.60      15.573
Health Care              ABBV   53.95       2.954
Information Technology    ACN   79.79       8.326
Financials                ACE  102.91      86.897

над множествами

DataFrame для примера:

In [15]:
data_rnd_part_1 = sp500.sample(100, random_state=333)
data_rnd_part_2 = sp500.sample(100, random_state=777)

In [16]:
data_rnd_part_1.head()

                        Sector   Price  Book Value
Symbol
NDAQ                Financials   36.45      36.578
FDO     Consumer Discretionary   56.65      14.122
EBAY    Information Technology   52.02      15.477
ECL                  Materials  108.05      24.019
LO            Consumer Staples   60.20      -5.953

In [17]:
data_rnd_part_2.head()

                        Sector   Price  Book Value
Symbol
SRCL               Industrials  112.48      20.802
ADP     Information Technology   78.85      13.729
SPLS    Consumer Discretionary   11.65       9.525
COV                Health Care   71.19      21.219
HRL           Consumer Staples   46.66      13.311

объединение:

In [20]:
ind_union = data_rnd_part_1.index | data_rnd_part_2.index
ind_union

<ipython-input-20-ec99fed18b61>:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead
  ind_union = data_rnd_part_1.index | data_rnd_part_2.index

Index(['AA', 'ACT', 'ADBE', 'ADP', 'AEE', 'AFL', 'AIZ', 'ALL', 'ALTR', 'ALXN',
       ...
       'VTR', 'VZ', 'WHR', 'WMB', 'WU', 'XOM', 'XRAY', 'XRX', 'ZMH', 'ZTS'],
      dtype='object', name='Symbol', length=177)

пересечение:

In [21]:
ind_intersection = data_rnd_part_1.index & data_rnd_part_2.index
len(ind_intersection)

<ipython-input-21-d676b800de3e>:1: FutureWarning: Index.__and__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__and__.  Use index.intersection(other) instead
  ind_intersection = data_rnd_part_1.index & data_rnd_part_2.index

23

разность:

In [22]:
ind_diff = data_rnd_part_1.index.difference(data_rnd_part_2.index)
len(ind_diff)

77

## Иерархическая индексация

сначала помещаем символы в столбец

In [23]:
reindexed = sp500.reset_index()

In [25]:
reindexed.head()

  Symbol                  Sector   Price  Book Value
0    MMM             Industrials  141.14      26.668
1    ABT             Health Care   39.60      15.573
2   ABBV             Health Care   53.95       2.954
3    ACN  Information Technology   79.79       8.326
4    ACE              Financials  102.91      86.897

а теперь индексируем DataFrame data по столбцам Sector и Symbol

In [26]:
multi_fi = reindexed.set_index(['Sector', 'Symbol'])
multi_fi.head()

                                Price  Book Value
Sector                 Symbol
Industrials            MMM     141.14      26.668
Health Care            ABT      39.60      15.573
                       ABBV     53.95       2.954
Information Technology ACN      79.79       8.326
Financials             ACE     102.91      86.897

наш индекс - это MultiIndex

In [27]:
type(multi_fi.index)

pandas.core.indexes.multi.MultiIndex

он имеет 2 уровня

In [30]:
len(multi_fi.index.levels)

2

каждый уровень индекса - это индекс

In [31]:
multi_fi.index.levels[1]

Index(['A', 'AA', 'AAPL', 'ABBV', 'ABC', 'ABT', 'ACE', 'ACN', 'ACT', 'ADBE',
       ...
       'XLNX', 'XOM', 'XRAY', 'XRX', 'XYL', 'YHOO', 'YUM', 'ZION', 'ZMH',
       'ZTS'],
      dtype='object', name='Symbol', length=500)

изменение порядка уровней индекса:

In [32]:
multi_fi.reorder_levels([1, 0], axis=0).head()

                                Price  Book Value
Symbol Sector
MMM    Industrials             141.14      26.668
ABT    Health Care              39.60      15.573
ABBV   Health Care              53.95       2.954
ACN    Information Technology   79.79       8.326
ACE    Financials              102.91      86.897

получаем все акции, которые имеют значение Industrials

обратите внимание, что в результатах индекс уровня 0 не выводится

In [33]:
multi_fi.xs('Industrials').head()

         Price  Book Value
Symbol
MMM     141.14      26.668
ALLE     52.46       0.000
APH      95.71      18.315
AVY      48.20      15.616
BA      132.41      19.870

отбираем строки, в которых индекс уровня 1 (Symbol) имеет значение ALLE

In [34]:
multi_fi.xs('ALLE', level=1)

             Price  Book Value
Sector
Industrials  52.46         0.0

скомбинируем уровни индексов

In [35]:
multi_fi.xs('Industrials').xs('UPS')

Price         102.73
Book Value      6.79
Name: UPS, dtype: float64

комбинируем уровни индексов, используя кортеж

In [36]:
multi_fi.xs(('Industrials', 'UPS'))

Price         102.73
Book Value      6.79
Name: (Industrials, UPS), dtype: float64

## [Типы](http://pandas.pydata.org/pandas-docs/stable/user_guide/advanced.html#index-types)

### Основной тип Index

покажем, что столбцы фактически являются индексом

In [37]:
sp500.columns

Index(['Sector', 'Price', 'Book Value'], dtype='object')

In [38]:
sp500.index

Index(['MMM', 'ABT', 'ABBV', 'ACN', 'ACE', 'ACT', 'ADBE', 'AES', 'AET', 'AFL',
       ...
       'XEL', 'XRX', 'XLNX', 'XL', 'XYL', 'YHOO', 'YUM', 'ZMH', 'ZION', 'ZTS'],
      dtype='object', name='Symbol', length=500)

### Int64Index и RangeIndex

Явно создаем Int64Index

In [39]:
df_i64 = pd.DataFrame(np.arange(10, 20), index=np.arange(0, 10))
df_i64.head()

    0
0  10
1  11
2  12
3  13
4  14

смотрим индекс

In [40]:
df_i64.index

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

по умолчанию мы получаем RangeIndex

In [41]:
df_range = pd.DataFrame(np.arange(10, 15))
df_range.head()

    0
0  10
1  11
2  12
3  13
4  14

In [42]:
df_range.index

RangeIndex(start=0, stop=5, step=1)

### Float64Index

In [43]:
df_f64 = pd.DataFrame(np.arange(0, 1000, 5),
                     np.arange(0.0, 100.0, 0.5))
df_f64.head()

      0
0.0   0
0.5   5
1.0  10
1.5  15
2.0  20

In [44]:
df_f64.index

Float64Index([ 0.0,  0.5,  1.0,  1.5,  2.0,  2.5,  3.0,  3.5,  4.0,  4.5,
              ...
              95.0, 95.5, 96.0, 96.5, 97.0, 97.5, 98.0, 98.5, 99.0, 99.5],
             dtype='float64', length=200)